src/DataProcessors/ИмпортЗаявок/ИмпортЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортЗаявок</name>
</mdclass:DataProcessor>

src/InformationRegisters/ЛогЗагрузки/ЛогЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогЗагрузки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтруктураДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект1С</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОКЕИ</types>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.БоевыеЧасти</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.Заявка</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ОКСМ</types>
      <types>CatalogRef.ЗаказыПрисоединенныеФайлы</types>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ИмпортЗаявок/Forms/Форма/Module.bsl
#Область ПеременныхМодуля

#Если Сервер Тогда
Перем ТекСтруктураДанных;
Перем ТекИмяФайла;
#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПреобразоватьВЧисло(Знач СтрЧисло);
	
	СтрокаЧисел = "0123456789";
	
	ТекЧисло = "0";
	
	Для к =1 По СтрДлина(СтрЧисло) Цикл
		
		ТекСимв = Сред(СтрЧисло,к,1);
		
		Если Найти(СтрокаЧисел,ТекСимв) Тогда
		
			ТекЧисло = ТекЧисло + ТекСимв;
			
		ИначеЕсли ТекСимв = "." ИЛИ ТекСимв = "," Тогда
			
			ТекЧисло = ТекЧисло + ТекСимв;
		
		ИначеЕсли ТекСимв = "-" И ТекЧисло = "0" Тогда
			
			ТекЧисло = "-0";
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Попытка
		ПреобразованноеЧисло = Число(ТекЧисло);
	Исключение
		ПреобразованноеЧисло = 0;
	КонецПопытки; 
	
	
	Возврат ПреобразованноеЧисло;
	
КонецФункции

&НаСервере
Процедура ЗаписатьВЛог(ГУИД,Ссылка,ИдентификаторСтроки=Неопределено,Описание,СтруктураДанных=Неопределено)
	
	МЗ = РегистрыСведений.ЛогЗагрузки.СоздатьМенеджерЗаписи();
	МЗ.ГУИД = ГУИД;
	МЗ.Файл = "" + ПутьКФайлу + ?(ТекИмяФайла="","","\"+ТекИмяФайла);
	МЗ.Объект1С = Ссылка;
	МЗ.Период = ТекущаяДата();
	МЗ.ИдентификаторСтроки = ИдентификаторСтроки;
	МЗ.Описание = Описание;
	МЗ.СтруктураДанных = СтруктураДанных;
	МЗ.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти


#Область ЗагрузкаДанных

&НаСервере
Функция ИзвлечьХМЛИзАрхива(Вложение)
	
	ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
	ДвоичныеДанные = Вложение.Получить();
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	
	ДвоичныеДанные.Записать(ИмяАрхива);
	
	// Распаковываем файлы
	ЧтениеЗИП = Новый ЧтениеZipФайла(ИмяАрхива);
	
	ПолныйПуть = "";
	
	Для каждого ТекАрхив Из ЧтениеЗИП.Элементы Цикл
		// файл не xml пропускаем
		Если СтрНайти(ТекАрхив.Расширение, "xml") > 0 Тогда
			
			ВремКаталог = КаталогВременныхФайлов();
			ПолныйПуть = ВремКаталог + ТекАрхив.Имя;
			
			ЧтениеЗИП.Извлечь(ТекАрхив, ВремКаталог);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеЗИП.Закрыть();
	
	ДвДанные = Новый ДвоичныеДанные(ПолныйПуть);
	
	УдалитьФайлы(ИмяАрхива);
	УдалитьФайлы(ПолныйПуть);
	
	Возврат ПоместитьВоВременноеХранилище(ДвДанные);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНаСервере(АдресФайла, ДополнительныеПараметры)
	
	Вложение = Неопределено;
	Если ДополнительныеПараметры.Свойство("ВыбранноеИмяФайла") Тогда
		ВыбранноеИмяФайла = ДополнительныеПараметры.ВыбранноеИмяФайла;
		ВыбранноеИмяФайлаДвДанные = ДополнительныеПараметры.ВыбранноеИмяФайлаДвДанные;
		
		Если СтрНайти(ВыбранноеИмяФайла, "zip") > 0 Тогда
			Вложение = Новый ХранилищеЗначения(ВыбранноеИмяФайлаДвДанные);
			АдресХМЛФайла = ИзвлечьХМЛИзАрхива(Вложение);
		Иначе
			АдресХМЛФайла = ПоместитьВоВременноеХранилище(ВыбранноеИмяФайлаДвДанные);
		КонецЕсли; 
	КонецЕсли; 
		
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Адрес", АдресХМЛФайла);
	ДопПараметры.Вставить("Вложение", Вложение);
		
	Результат = ОбменСИнформационнымиСистемами.ПрочитатьXMLФайлЗапросыИЗаявки(ДопПараметры);
	
	Если Результат.Выполнено Тогда
		Сообщить("Загрузка успешно завершена");
	Иначе
		Сообщить(Результат.Описание);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявки(Команда)
	
	АдресФайла = "";
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Не указан путь к файлу", 4);
		Возврат;
	КонецЕсли; 

	НачатьПомещениеФайла(Новый ОписаниеОповещения("ОбработкаПомещенияФайла", ЭтотОбъект, Новый Структура("КоличествоФайлов,НомерФайла,ТекущийФайл",1,1,"")), АдресФайла, ""+ПутьКФайлу+"",Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПомещенияФайла(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Состояние("" + ТекущаяДата() + " Загружается: " + ДополнительныеПараметры.ТекущийФайл,Цел(100/ДополнительныеПараметры.КоличествоФайлов*ДополнительныеПараметры.НомерФайла));

	ДополнительныеПараметры.Вставить("ВыбранноеИмяФайла", ВыбранноеИмяФайла);
	ДополнительныеПараметры.Вставить("ВыбранноеИмяФайлаДвДанные", Новый ДвоичныеДанные(ВыбранноеИмяФайла));
	
	ЗагрузитьНаСервере(АдресФайла, ДополнительныеПараметры);
    
КонецПроцедуры

#КонецОбласти


#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = ПутьКФайлу;
	Диалог.Фильтр = "XML|*.xml|ZIP|*.zip";
	Диалог.МножественныйВыбор = Ложь;
	
    Диалог.Показать(Новый ОписаниеОповещения("ОбработкаВыборафайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыборафайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
